---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceAlbedo
source: html/f9c208e5-baf7-e192-1fa7-d5b9dd314653.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceAlbedo Property

The property labeled "Color" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceAlbedo { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.